{"Blog/Internship":{"title":"I got an Internship at Hadrian!","links":[],"tags":[],"content":"This summer I’ve been interning at the wonderful Hadrian Automation as a robotics intern. I learned about the company initially through seeing a youtube video on tech startups. After realizing they were in the Los Angeles, I put them on the list of companies that I’d be interested in interning at. As it was nearing the end of the school year, I finally got in touch with them and started to talk with them about an internship position. Rick Shanor was immensly helpful in the process and eventually gave me a take home assignment. It was a neat project to program a robot in with RoboDK’s Python API. I haven’t programmed arm robots before and had some interesting problems with the robot colliding with other feaures in the scene. I submitted my work and got some questions about what I could improve on. Some back and forth later, I was offered a position in their Los Angeles Factory 2 as a robotics intern.\nWhat do I do there?\nRick has been very attentive to the interests that I have and assigned me to a project that involved many of my interests and skills together. I am creating a proof of concept for a automation cell to assemble and disassemble cnc tools! It may not sound exciting at first but after working on this project for a month at this point and another month to go, I am very excited about it. I have learned alot about 3d printing, cnc, robot programming, programming a python monorepo, removing my code from a python monorepo, and the details of building tools for cnc machines. I have access to all of the tools that I could possibly need to make this project happen and the only real limiting factor is how fast I can use them and interate on my desins. I am also just a message and few meters away from industry experts in computer programming, robotics, and engineering anytime that I need help with a problem. The team at hadrian has gotten me out of alot of trouble by coming over to my desk, talking to me for a few minutes and dropping a wisdom bomb that changes my entire outlook on the project and just how much I have to learn.\nWhat’s it like at a startup?\nHadrian is a few years old now. In the Aerospace Manufacturing industry though, they are babies. They currently have one factory / headquarters that houses all of the employees. Many of them work on the factory floor to be closer to their area of work, or because there’s not enough space in the office portion of the building. The warehouse itself is a wonderful, temperature controlled, well-lit, maze of cnc machines and robots that whir around 24/7. While everyone is in close quearters, they hire quickly and you’ll meet new people often but also find your coworkers to eat lunch with. Talking about lunch, it’s ordered for us with a $15 credit! Though I don’t get any of the other benifits like health insurance etc, I do get that free lunch and it is amazing. Combined with the very accomidating staffroom with a soda machine and snack galore, I’m well fed. There’s also alot of 3d printers around. I’ve gotten to print many prototypes through there, often splitting one part into multiple prints that run simultaniously to save time. By the end of the day I can run through 5 prototypes of a part. They also gave me a laptop to workon and a desktop to work on too. I don’t get to keep it forever, but while I’m here, It is the fastest computer I’ve ever used all smashed into a small dell pc case that’s very unassuming.\nDo I like it?\nHell yeah. I can recommend to anyone, Hadrian Automation is a great place to intern at. I’m not going to mention my hourly pay directly because I might get in trouble for that, but I’m very happy with it.\nWhy haven’t you posted on your blog more?\nIf you really are stalking me virtually through this blog, I’ll be sure to update it more often with what’s going on in my life. At least the cool parts that the void would like me to cast into it and for the deep state to collect. Stay hydrated and thanks for reading."},"Notes/General-Psychology/Brain":{"title":"Brain","links":[],"tags":[],"content":"Brain Organization and parts\n\n\nHind Brain\nEssential/ automatic survival function\nmost primitive part of the brain\nlocated twords the back and lower, encapsulated the brain stem\nmanages heart beat, breathing, digestion, essiecial things.\nMost ancient and similar to other organisms\nmost protected by being deeper in hte head\nFirst developing as a embreo, it is prioratized in growth first until it’s a fetus\n\n\nPons\nInvolved with repiration, movement, waking, sleeping, dreaking,\n\n\nCerebellum\nImportant for balance, and coordinated voluntary muscle movement\nalso called the baby brain, is a distinct chunk of the brain located at the nape of the brain.\n\n\nMedulla\nVital functions like heartbeat\n\n\nMidbrain\nSleep/arousal, motor control, sensory function\nlocated in the center of the brain\n\n\nBrain stem\nConnects the brain to the spinal cord. The part where the\n\n\nReticular formatoin\nIn charge of arousal and screens incoming information.\ntells you how much awae you should be to the sensoy information that you recieve\n\n\nSpinal cord\nResponsible for transmitting info from the brain to the rest of hte body and controls reactoins\n\n\nForebrain\ndifferenciates humans from other animals the most\nIn charge of thinking emotion memory\nDevelops latest in pregnancy\nit’s the largest part of the brain\nand the least protects part of the brain\nlocated on the top and front on the outer of the brain\nIn charge of memory and emotion\n\n\nHypo thalamus\nDrives\nBasic human motivations (ex. thirsty, sex, agrression,) govern endoctrine system; linked to emotion and reward.\n\n\nThalamus\nBrain’s relay station\nCommunication between different parts of your brain\n\n\nAmygdata\nA limbic system structiure\nIn charge of emotions\n\n\nHypocampuss\nin charge of memory\nalso part of the limbic system\n\n\nCerebral cortex\nter mental processes. Covers the whole brain on the top and frontmost.\nin charge of complex behavirs and higher mental processes\n\n\nLobes and hemisperes of the Cerebral cortex\n\n\nLobes\n\n\nFrontal\n\n\nSpeech production (Broca’s is on the left)\n\n\nIncludes the Motor control\n\n\nhigh functions like thinking, personality, memory\n\n\nParietal\n\n\nSensation\n\n\nReceives and interprets bodily senstations\n\n\nOccipictal\n\n\nVision and visual perception\n\n\nTemporal\n\n\nAudition (hearing)\n\n\nLanguage comprehension (Wernicke’s on the left)\n\n\nHemispheres\nLeft and right hemispheres are from the perspective of the person’s brain. so smae as you, your left and your right are with your left hemi and right hemi spheres\nThin outer layers responsible for most complex behaviors and high\n\n\nForebrain is contralateral\nThe right side is controlling hte left side and the left side controlls the right isde.\nthis is a commpn features of vertebrates\nwhen someone has a stroke then if the strk affects the right side of the brain then the the left side is affected\n\n\nSpecializatoin of the Hemispheres\neach hemisphere only has slight areas of specializations but they work together\nright and left brained indicviduals are not distinct groups and are a myth\n\n\nCorpus callosum\nConnects the two hemisphere snad works in a coordinated way. Thick band of axons\nCases of peoples copus callosum bring cut were common to reduce sezures\n\n\nSplit Brain Vision\n\n\nThe visual fiels also get process by the antilateral region of the brain. the left visual irld by the right briain hemisphere and etc.\n\n\nthe nerves of the eyes are wired so each eyes has a left and right visual field distinctively\n\n\nUnit 3 Lecture Exercise 2\n\n\na) yes, b) yes, c) no\nlogseq.order-list-type:: number\n\n\na) no, b) no, c) yes\nlogseq.order-list-type:: number\n\n\nNervous system organization:\n\n\nPeripheral nervous system\n\n\nSomatic\n\n\nAutonomic\n\n\nSympathetic\nfight / flight / freeze response\n\n\npupils dilate\n\n\nsalicatoin dereases\n\n\nheart accelerates\n\n\nlungs dilate\n\n\ndigestion end elimination decrease\n\n\nsexual climax\n\n\nsweating increases\n\n\nParasympathetic\nrest / digest response\n\n\npupils ocnstrict\n\n\nsalivatoin increases\n\n\nheart slows\n\n\nlungs  construct\n\n\ndigestion and elimination increase\n\n\nsexual arousal\n\n\nno sweating\n\n\nUnit 3 Lecture Exercise 3\n\n"},"Notes/General-Psychology/Neurons-and-Drugs":{"title":"Neurons and Drugs","links":[],"tags":[],"content":"\n\nNervous system organization\n\ncentral nervous system\n\nbrain\n\n\nperipheral\n\nSomatic\nautonomic\n\n\n\n\nUnderstanding neuron\n\ncell body\naxon\n\n\nkey parts and functions of a neuron\n\ncell body\ndendrites\nnucleus\nmyelin sheath / myelination\nnodes of Ranvier\nterminal buttons\nSOMA\nsynapse\naction potential\n\n\nMyelin production impacted\nCommunication between neurons\n\nsynapse gap / junction or synaptic cleft\nneurotransmitter\nPre-synaptic neuron\npost-synaptic neuron\nSSRI (Selective serotonin reuptake inhibitor)\nParkinson’s\nsending a chemical signal\nreceiving a chemical signal\ndealing with ‘leftovers’\nNeural communication\n\n\nDrugs\n\nAgonist Drug\nAntagonist drug\nEffects of poisons and Drugs on neural transmission\n\nHow natural neurotransmitters work\nA artificial drug on neurotransmissions\nnatural androgynous Nero transmitters\nartificial exogenous opioids\n\n\nEndogenous\nExogenous\nnatural\nsynthetic\n\n\nTools for brain research\n\nfunction\n\nelectrical recordings\nfMRI\nPET Scan\n\n\nstructure\n\nMRI\nCT Scan\nOther Methods\n\n\n\n\n\n\nNervous system organization\nmeow pi/15\ncentral nervous system\ncentral with the brain and the spinal cord\nsends signal to and from the brain and PNS and controls reflexes\nbrain\ndirects mental process and maintains basic life functions\ntakes around a third of your daily glucose intake per day\nperipheral\ncaries from the brain and spinal cord to the peripheral\nSomatic\nvoluntary muscles and motor signals\nautonomic\ninvoluntary like stress response\nUnderstanding neuron\nnerve cells\nI should be able to draw a loose neuron\nbasic building block of the nervous system\ncell body\ncontains the cell nucleus (aka SOMA)\naxon\nconveys impulses away from the cell body\nkey parts and functions of a neuron\ncell body\nreceives information\ndendrites\nreceive information from other cells’\nnucleus\ncenter of the cell\nmyelin sheath / myelination\nCovering the axon, made of pieces of myelin which insulate and speed up signals in the axon\nsignals jump in between the gaps of the myelin sheets which are called\nnodes of Ranvier\nthe nodes that a signal actually travels through\nterminal buttons\nthe termination of the axon and releases chemicals called neurotransmitters\nSOMA\nthe cell body\nsynapse\na connection between neurons\naction potential\na voltage across the axon\nMyelin production impacted\nIn the first few weeks and moths of like, myelin is very important. It’s directly connected with social connection and response. Research shows that social isolation during there critical periods prevent cells from producing the right amount of myelin. Sadly this loss of normal levels of myelin leads to long term problems in cognitive functioning (Makinodan et al., 2012)\nCommunication between neurons\nsynapse gap / junction or synaptic cleft\ngap between neurons\nneurotransmitter\nchemical messenger (Serotonin, Dopamine, etc.)\nPre-synaptic neuron\ntransmitting neurotransmitters to the post-synaptic transmitter\npost-synaptic neuron\nreceiving neurotransmitters from the post-synaptic transmitter\nMany complications with mental health and psychotropic medication interact with this interaction (SSRIs)\nSSRI (Selective serotonin reuptake inhibitor)\nSSRIs interact with the reuptake of serotonin by preventing it and keeping serotonin floating around the synapse for the post-synaptic neuron to receive it. This is used to treat mood/anxiety disorders.\nParkinson’s\ncould be related to not enough dopamine, psychosis could be too much. Medications like SSRIs that interact with dopamine could change the interaction with molecules to assure a more balances amount of dopamine\nsending a chemical signal\nreleased for the terminal button at the end of the axon, across the synaptic gap\nreceiving a chemical signal\nreceiving neuron (post-synaptic)_\ndealing with ‘leftovers’\nreuptake of neurotransmitters that did not get receive by the post-synaptic neuron get reuptake by the post-synaptic neuron\nNeural communication\nCommunications within a neuron is electrical, but\nCommunications between neurons is chemical\nDrugs\nAgonist Drug\nmimics or enhances a neurotransmitters effect\nmost addictive drugs are Agonist\nex Parkinson drug (low dopamine) (SSRIs)\nAntagonist drug\nblocks or hinders a neurotransmitter’s effect\nex. anti-psychotic drugs (excess dopamine)\ncan be addictive by blocking aversive feelings\nEffects of poisons and Drugs on neural transmission\nHow natural neurotransmitters work\na normal neurotransmitter has the same characteristic (think a key in a lock) as a receiving neuron’s dendrites.\nNeurotransmitters without the right characteristic will not fit with the receptors and don’t stimulate the dendrites. This blocks a signal at the receives\nA artificial drug on neurotransmissions\nArtificially you can emulate both antagonistic (blocking) or agonistic (stimulating) neurotransmitters. These fit the characteristics of natural neurotransmitters and can react to the dendrites as natural ones\nnatural androgynous Nero transmitters\nendorphins that stimulate will be released with stimulation (ex. exercise, sex, rewarding activity)\nnaturally the body will not create excessive amount of endorphins\nartificial exogenous opioids\nWill release excessive endorphins more than what is naturally possible\nAddiction is a trained response to these endorphins, and this simplified by the high doses of endorphins.\nThe body will naturally adapt to this to tune the body to a normal amount of received endorphins by losing sensitivity to endorphins.\nThis over time will dull the reaction to natural reactions of endorphins and amplify opioid dependence\nEndogenous\ninside of body already\nExogenous\nanything we’re taking form the outside\nnatural\nmade from plants and animals\nmorphine, cocaine\nsynthetic\nmade from chemicals in a laboratory. Typically, stronger.\nFentanyl\nTools for brain research\nFunction\nelectrical recordings\nfMRI\ntracks oxygen levels, which is an indicator of blood flow since your blood is oxygenated. So more oxygenated means more bloods flow and more oxygen being used. Active areas of the brain use more blood.\nPET Scan\nWork by injecting a small amount of radioactive material into your blood flow. The PET scan show us what is metabolizing things and where blood flow is going by picking up background radiation from the injection\nStructure\nMRI\nCT Scan\nOther Methods"},"Notes/General-Psychology/Resources":{"title":"Resources","links":[],"tags":[],"content":"\n\nSona\nCanvas\n\n\nSona\nusfca.sona-systems.com/default.aspx\nCanvas\nusfca.instructure.com/courses/1625332\nTextbook\nnoba.to/4rnbga6m"},"index":{"title":"Jet's Stuff","links":[],"tags":[],"content":"Who am I?\nI am currently a second-year computer science major at the University of San Francisco.\nThings I like\n\nComputers\nEngineering\nArt\nLinux\nRust\nHiking\nNovels\nRacecars\nGliders\nFood\n\nSocials\n\nGithub\nBluesky\nLinkedIn\nLeetcode\n"},"pages/contents":{"title":"contents","links":[],"tags":[],"content":"\n\n"}}